---
kind: type
id: T:Autodesk.Revit.DB.FilterIntegerRule
source: html/a1c00400-62b9-8f42-fbd2-fa36725136aa.htm
---
# Autodesk.Revit.DB.FilterIntegerRule

A filter rule that operates on integer values in a Revit project.

## Syntax (C#)
```csharp
public class FilterIntegerRule : FilterNumericValueRule
```